
DROP TABLE Medical_Data; 
CREATE TABLE Medical_Data
(
    FirstName VARCHAR(50) NOT NULL, 
    LastName VARCHAR(50) NOT NULL, 
    MiddleName VARCHAR(50) NOT NULL,
    PassportID VARCHAR(50) NOT NULL, 
    Zipcode VARCHAR(50) NOT NULL,
    Age VARCHAR(50) NOT NULL, 
    Admission timestamp NOT NULL, 
    Discharge timestamp NOT NULL
);

INSERT INTO Medical_Data VALUES('Гавриил', 'Панов', 'Самуилович', '6824205916', 799409, 19, '2017-12-24 19:45:10-07', '2017-12-24 20:45:10-07');
INSERT INTO Medical_Data VALUES('Галактион', 'Рыбаков', 'Святополкович', '9158629551', 807340, 5, '2018-12-24 19:45:10-07', '2018-12-24 20:45:10-07');
INSERT INTO Medical_Data VALUES('Геласий', 'Суворов', 'Святославович', '1299257652', 623781, 8, '2016-12-24 19:45:10-07', '2016-12-24 20:45:10-07');
INSERT INTO Medical_Data VALUES('Геннадий', 'Абрамов', 'Севастьянович', '7271518446', 621796, 51, '2015-12-24 19:45:10-07', '2015-12-24 20:45:10-07');
INSERT INTO Medical_Data VALUES('Георгий', 'Воронов', 'Семёнович', '3543887480', 525937, 43, '2014-12-24 19:45:10-07', '2014-12-24 20:45:10-07');
INSERT INTO Medical_Data VALUES('Герасим', 'Мухин', 'Серафимович', '6630978492', 100210, 6, '2017-01-24 19:45:10-07', '2017-01-24 20:45:10-07');
INSERT INTO Medical_Data VALUES('Герман', 'Архипов', 'Сильвестрович', '3247897902', 100862, 35, '2018-02-24 19:45:10-07', '2018-02-24 20:45:10-07');
INSERT INTO Medical_Data VALUES('Нестор', 'Трофимов', 'Созонович', '5360322874', 100365, 14, '2016-03-24 19:45:10-07', '2016-03-24 20:45:10-07');
INSERT INTO Medical_Data VALUES('Глеб', 'Мартынов', 'Софронович', '3816751132', 100860, 7, '2015-04-24 19:45:10-07', '2015-04-24 20:45:10-07');
INSERT INTO Medical_Data VALUES('Гордей', 'Емельянов', 'Спиридонович', '9782852529', 100469, 26, '2014-05-24 19:45:10-07', '2014-05-24 20:45:10-07');
INSERT INTO Medical_Data VALUES('Григорий', 'Горшков', 'Станиславович', '8093675273', 100318, 11, '2017-01-01 19:45:10-07', '2017-01-01 20:45:10-07');
INSERT INTO Medical_Data VALUES('Иван', 'Чернов', 'Степанович', '3077399337', 100855, 27, '2018-02-02 19:45:10-07', '2018-02-02 20:45:10-07');
INSERT INTO Medical_Data VALUES('Макар', 'Овчинников', 'Прохорович', '6363241609', 749656, 47, '2016-03-03 19:45:10-07', '2016-03-03 20:45:10-07');
INSERT INTO Medical_Data VALUES('Максим', 'Селезнёв', 'Разумникович', '7832977103', 927349, 12, '2015-04-04 19:45:10-07', '2015-04-04 20:45:10-07');
INSERT INTO Medical_Data VALUES('Марк', 'Панфилов', 'Родионович', '5947386145', 996622, 24, '2014-05-05 19:45:10-07', '2014-05-05 20:45:10-07');
INSERT INTO Medical_Data VALUES('Мартын', 'Копылов', 'Родославович', '7732466255', 938072, 54, '2017-01-01 10:45:10-07', '2017-01-01 20:45:10-07');
INSERT INTO Medical_Data VALUES('Матвей', 'Михеев', 'Романович', '3255398106', 841072, 49, '2018-02-02 12:45:10-07', '2018-02-02 20:45:10-07');
INSERT INTO Medical_Data VALUES('Мелентий', 'Галкин', 'Ростиславович', '1936398743', 550072, 50, '2016-03-03 13:45:10-07', '2016-03-03 20:45:10-07');
INSERT INTO Medical_Data VALUES('Мирон ', 'Назаров', 'Русланович', '6970846960', 825072, 58, '2015-04-04 14:45:10-07', '2015-04-04 20:45:10-07');
INSERT INTO Medical_Data VALUES('Харитон', 'Лобанов', 'Виссарионович', '6264625003', 116072, 10, '2014-05-05 15:45:10-07', '2014-05-05 20:45:10-07');

SELECT * FROM Medical_Data; 